app/controllers/places_controller.rb

  def index
    @places = Place.all(:order => :last_ate_at)
---
SELECT * FROM "places" ORDER BY last_ate_at

  def show
    if params[:id] == 'random'
      @place = Place.first(:order => 'Random()')
    else
      @place = Place.find(params[:id])
---
SELECT * FROM "places" ORDER BY Random() LIMIT 1
SELECT * FROM "places" WHERE ("places"."id" = 1)

  def eat_at
    @place = Place.find(params[:id])
    @place.last_ate_at = Time.now
    @place.save
---
SELECT * FROM "places" WHERE ("places"."id" = 4)
UPDATE "places" SET "updated_at" = '2009-12-15 18:32:36', "last_ate_at" = '2009-12-15 18:32:36' WHERE "id" = 4

  def edit
    @place = Place.find(params[:id])
---
SELECT * FROM "places" WHERE ("places"."id" = 7)

  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("name", "last_ate_at", "created_at", "updated_at") VALUES('Portillo''s', '2009-12-15 18:25:00', '2009-12-15 18:25:24', '2009-12-15 18:25:24')

  def update
    @place = Place.find(params[:id])

    respond_to do |format|
      if @place.update_attributes(params[:place])
---
SELECT * FROM "places" WHERE ("places"."id" = 7)
UPDATE "places" SET "updated_at" = '2009-12-15 18:34:38', "name" = 'Potbelly', "last_ate_at" = '2009-12-15 18:34:00' WHERE "id" = 7

  def destroy
    @place = Place.find(params[:id])
    @place.destroy
---
SELECT * FROM "places" WHERE ("places"."id" = 1)
DELETE FROM "places" WHERE "id" = 1